## Staging: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       NAME                        |
|--------|---------------------------------------------------|
| add    | `aws_security_group.weblate_efs`                  |
|        | `aws_security_group_rule.weblate_efs_ingress_ecs` |
|        | `aws_security_group_rule.weblate_egress_efs`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.weblate_efs will be created
  + resource "aws_security_group" "weblate_efs" {
      + arn                    = (known after apply)
      + description            = "Weblate EFS - ingress from ECS"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "weblate-efs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-07c0b4549041f39d0"
    }

  # aws_security_group_rule.weblate_efs_ingress_ecs will be created
  + resource "aws_security_group_rule" "weblate_efs_ingress_ecs" {
      + description              = "Ingress from Weblate ECS task to EFS"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-00b97951303b4dac8"
      + to_port                  = 2049
      + type                     = "ingress"
    }

  # aws_security_group_rule.weblate_egress_efs will be created
  + resource "aws_security_group_rule" "weblate_egress_efs" {
      + description              = "Egress from Weblate ECS task to EFS"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-00b97951303b4dac8"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "egress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + weblate_security_group_efs_id      = (known after apply)

Warning: Argument is deprecated

  with module.weblate_vpc.aws_eip.nat,
  on .terraform/modules/weblate_vpc/vpc/main.tf line 40, in resource "aws_eip" "nat":
  40:   vpc = true

use domain attribute instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
